RT-Thread/rt-thread/bsp/nxp/mcx/mcxa/Libraries/drivers/drv_can.c
/*
 * Copyright (c) 2006-2025, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2025-12-23     CYFS         the first version.
 * 2026-07-05     WANGYU       add CAN-FD and loopback support.
 */

#include <rtdevice.h>

#ifdef RT_USING_CAN

#include "fsl_common.h"
#include "fsl_clock.h"
#include "fsl_flexcan.h"

#define TX_MB_IDX       (0)
#define RX_MB_IDX       (1)
#define RX_MB_COUNT     (1)
#define CAN_POLL_TIMEOUT (10000000U)

enum
{
#ifdef BSP_USING_CAN0
    CAN0_INDEX,
#endif
#ifdef BSP_USING_CAN1
    CAN1_INDEX,
#endif
};

struct imxrt_can
{
    char                    *name;
    CAN_Type                *base;
    IRQn_Type               irqn;
    uint32_t                instance;
    clock_div_name_t        clock_div_name;
    clock_attach_id_t       clock_attach_id;
    flexcan_handle_t        handle;
    struct rt_can_device    can_dev;
    flexcan_frame_t         frame[RX_MB_COUNT];
#ifdef RT_CAN_USING_CANFD
    flexcan_fd_frame_t      framefd[RX_MB_COUNT];
    rt_bool_t               fd_enabled;
#endif
    rt_uint32_t             filter_mask;
};

static void _can_dump_err(struct imxrt_can *can, const char *stage)
{
    rt_kprintf("%s: %s, MCR=0x%08x ESR1=0x%08x IFLAG1=0x%08x\n",
               can->name, stage, can->base->MCR, can->base->ESR1, can->base->IFLAG1);
}

static void _can_setup_loopback_mb(struct imxrt_can *can)
{
    flexcan_rx_mb_config_t mb_config;

    mb_config.format = kFLEXCAN_FrameFormatStandard;
    mb_config.type = kFLEXCAN_FrameTypeData;
    mb_config.id = FLEXCAN_ID_STD(0);

    FLEXCAN_SetRxMbGlobalMask(can->base, 0U);
    FLEXCAN_SetRxIndividualMask(can->base, RX_MB_IDX, 0U);

#ifdef RT_CAN_USING_CANFD
    if (can->fd_enabled)
    {
        FLEXCAN_SetFDRxMbConfig(can->base, RX_MB_IDX, &mb_config, true);
    }
    else
#endif
    {
        FLEXCAN_SetRxMbConfig(can->base, RX_MB_IDX, &mb_config, true);
    }
}

#ifdef RT_CAN_USING_CANFD
static rt_uint8_t _can_dlc2len(rt_uint8_t dlc)
{
    return (rt_uint8_t)DLC_LENGTH_DECODE(dlc);
}

static rt_uint8_t _can_len2dlc(rt_uint8_t len)
{
    static const rt_uint8_t table[] =
    {
        0, 1, 2, 3, 4, 5, 6, 7, 8,
        9, 9, 9, 9,
        10, 10, 10, 10,
        11, 11, 11, 11,
        12, 12, 12, 12,
        13, 13, 13, 13, 13, 13, 13, 13,
        14, 14, 14, 14, 14, 14, 14, 14,
        14, 14, 14, 14, 14, 14, 14, 14,
        15, 15, 15, 15, 15, 15, 15, 15,
        15, 15, 15, 15, 15, 15, 15, 15,
    };

    if (len <= 64)
    {
        return table[len];
    }

    return 15;
}
#endif

static void _can_fill_classic_frame(flexcan_frame_t *frame, const struct rt_can_msg *msg)
{
    if (RT_CAN_STDID == msg->ide)
    {
        frame->id = FLEXCAN_ID_STD(msg->id);
        frame->format = kFLEXCAN_FrameFormatStandard;
    }
    else
    {
        frame->id = FLEXCAN_ID_EXT(msg->id);
        frame->format = kFLEXCAN_FrameFormatExtend;
    }

    frame->type = (RT_CAN_DTR == msg->rtr) ? kFLEXCAN_FrameTypeData : kFLEXCAN_FrameTypeRemote;
    frame->length = msg->len;
    frame->dataByte0 = msg->data[0];
    frame->dataByte1 = msg->data[1];
    frame->dataByte2 = msg->data[2];
    frame->dataByte3 = msg->data[3];
    frame->dataByte4 = msg->data[4];
    frame->dataByte5 = msg->data[5];
    frame->dataByte6 = msg->data[6];
    frame->dataByte7 = msg->data[7];
}

static void _can_parse_classic_frame(struct rt_can_msg *msg, const flexcan_frame_t *frame)
{
    if (frame->format == kFLEXCAN_FrameFormatStandard)
    {
        msg->ide = RT_CAN_STDID;
        msg->id = frame->id >> CAN_ID_STD_SHIFT;
    }
    else
    {
        msg->ide = RT_CAN_EXTID;
        msg->id = frame->id >> CAN_ID_EXT_SHIFT;
    }

    msg->rtr = (frame->type == kFLEXCAN_FrameTypeData) ? RT_CAN_DTR : RT_CAN_RTR;
    msg->len = frame->length;
    msg->data[0] = frame->dataByte0;
    msg->data[1] = frame->dataByte1;
    msg->data[2] = frame->dataByte2;
    msg->data[3] = frame->dataByte3;
    msg->data[4] = frame->dataByte4;
    msg->data[5] = frame->dataByte5;
    msg->data[6] = frame->dataByte6;
    msg->data[7] = frame->dataByte7;
}

struct imxrt_can flexcans[] =
{
#ifdef BSP_USING_CAN0
    {
        .name = "can0",
        .base = CAN0,
        .instance = 0,
        .irqn = CAN0_IRQn,
        .clock_div_name = kCLOCK_DivFLEXCAN0,
        .clock_attach_id = kFRO_HF_DIV_to_FLEXCAN0,
    },
#endif
#ifdef BSP_USING_CAN1
    {
        .name = "can1",
        .base = CAN1,
        .instance = 1,
        .irqn = CAN1_IRQn,
        .clock_div_name = kCLOCK_DivFLEXCAN1,
        .clock_attach_id = kFRO_HF_DIV_to_FLEXCAN1,
    },
#endif
};

static rt_bool_t _can_is_loopback(const struct can_configure *cfg)
{
    return (cfg->mode == RT_CAN_MODE_LOOPBACK) ||
           (cfg->mode == RT_CAN_MODE_LOOPBACKANLISTEN);
}

static void _can_abort_rx(struct imxrt_can *can)
{
#ifdef RT_CAN_USING_CANFD
    if (can->fd_enabled)
    {
        FLEXCAN_TransferFDAbortReceive(can->base, &can->handle, RX_MB_IDX);
    }
    else
#endif
    {
        FLEXCAN_TransferAbortReceive(can->base, &can->handle, RX_MB_IDX);
    }
}

static void _can_enable_periph_clock(struct imxrt_can *can)
{
    clock_ip_name_t can_clocks[] = FLEXCAN_CLOCKS;

    CLOCK_EnableClock(can_clocks[can->instance]);
    CLOCK_SetClockDiv(can->clock_div_name, 2u);
    CLOCK_AttachClk(can->clock_attach_id);
}

static void _can_safe_deinit(struct imxrt_can *can)
{
    CAN_Type *base = can->base;

    _can_enable_periph_clock(can);

    /* FLEXCAN_Reset() inside FLEXCAN_Deinit() requires MDIS cleared. */
    if (0U != (base->MCR & CAN_MCR_MDIS_MASK))
    {
        (void)FLEXCAN_Enable(base, true);
    }

    FLEXCAN_Deinit(base);
}

static status_t _can_wait_mb_tx_done(struct imxrt_can *can, uint8_t mb_idx)
{
    CAN_Type *base = can->base;
    uint32_t timeout = CAN_POLL_TIMEOUT;

    while (0U == FLEXCAN_GetMbStatusFlags(base, (uint64_t)1U << mb_idx))
    {
        if (--timeout == 0U)
        {
            return kStatus_Timeout;
        }
    }

    FLEXCAN_ClearMbStatusFlags(base, (uint64_t)1U << mb_idx);
    return kStatus_Success;
}

static status_t _can_wait_mb_rx_done(CAN_Type *base, uint8_t mb_idx)
{
    uint32_t timeout = CAN_POLL_TIMEOUT;

    while (0U == FLEXCAN_GetMbStatusFlags(base, (uint64_t)1U << mb_idx))
    {
        if (--timeout == 0U)
        {
            return kStatus_Timeout;
        }
    }

    FLEXCAN_ClearMbStatusFlags(base, (uint64_t)1U << mb_idx);
    return kStatus_Success;
}

static void _can_loopback_post_rx(struct imxrt_can *can)
{
    rt_hw_can_isr(&can->can_dev, RT_CAN_EVENT_RX_IND | RX_MB_IDX << 8);
}

