RT-Thread/rt-thread/bsp/nxp/mcx/mcxa/Libraries/drivers/drv_can.c
static void _can_setup_mode(flexcan_config_t *config, const struct can_configure *cfg)
{
    switch (cfg->mode)
    {
    case RT_CAN_MODE_NORMAL:
        break;
    case RT_CAN_MODE_LISTEN:
        config->enableListenOnlyMode = true;
        break;
    case RT_CAN_MODE_LOOPBACK:
        config->enableLoopBack = true;
        config->disableSelfReception = false;
        config->enableIndividMask = false;
        break;
    case RT_CAN_MODE_LOOPBACKANLISTEN:
        config->enableLoopBack = true;
        config->enableListenOnlyMode = true;
        config->disableSelfReception = false;
        config->enableIndividMask = false;
        break;
    default:
        break;
    }
}

static void _can_start_rx(struct imxrt_can *can)
{
    flexcan_rx_mb_config_t mbConfig;
    flexcan_mb_transfer_t rxXfer;
    rt_uint8_t i, mailbox;

    mbConfig.format = kFLEXCAN_FrameFormatStandard;
    mbConfig.type = kFLEXCAN_FrameTypeData;
    mbConfig.id = FLEXCAN_ID_STD(0);

    for (i = 0; i < RX_MB_COUNT; i++)
    {
        mailbox = RX_MB_IDX + i;
        FLEXCAN_SetRxIndividualMask(can->base, mailbox, FLEXCAN_RX_MB_STD_MASK(0, 0, 0));

#ifdef RT_CAN_USING_CANFD
        if (can->fd_enabled)
        {
            FLEXCAN_SetFDRxMbConfig(can->base, mailbox, &mbConfig, true);
            rxXfer.framefd = &can->framefd[i];
            rxXfer.frame = RT_NULL;
            rxXfer.mbIdx = mailbox;
            FLEXCAN_TransferFDReceiveNonBlocking(can->base, &can->handle, &rxXfer);
        }
        else
#endif
        {
            FLEXCAN_SetRxMbConfig(can->base, mailbox, &mbConfig, true);
            rxXfer.frame = &can->frame[i];
#ifdef RT_CAN_USING_CANFD
            rxXfer.framefd = RT_NULL;
#endif
            rxXfer.mbIdx = mailbox;
            FLEXCAN_TransferReceiveNonBlocking(can->base, &can->handle, &rxXfer);
        }
    }
}

static void _can_enable_controller_irq(struct imxrt_can *can)
{
    FLEXCAN_EnableInterrupts(can->base, (uint32_t)kFLEXCAN_BusOffInterruptEnable |
                                         (uint32_t)kFLEXCAN_ErrorInterruptEnable |
                                         (uint32_t)kFLEXCAN_RxWarningInterruptEnable |
                                         (uint32_t)kFLEXCAN_TxWarningInterruptEnable);
    EnableIRQ(can->irqn);
}

#ifdef BSP_USING_CAN0
void CAN0_IRQHandler(void)
{
    rt_interrupt_enter();
    FLEXCAN_TransferHandleIRQ(CAN0, &flexcans[CAN0_INDEX].handle);
    rt_interrupt_leave();
}
#endif

#ifdef BSP_USING_CAN1
void CAN1_IRQHandler(void)
{
    rt_interrupt_enter();
    FLEXCAN_TransferHandleIRQ(CAN1, &flexcans[CAN1_INDEX].handle);
    rt_interrupt_leave();
}
#endif

static void flexcan_callback(CAN_Type *base, flexcan_handle_t *handle, status_t status, uint64_t result, void *userData)
{
    struct imxrt_can *can;
    flexcan_mb_transfer_t rxXfer;
    rt_uint8_t mb_idx;

    can = (struct imxrt_can *)userData;

    switch (status)
    {
    case kStatus_FLEXCAN_RxIdle:
        mb_idx = (rt_uint8_t)result;
        rt_hw_can_isr(&can->can_dev, RT_CAN_EVENT_RX_IND | mb_idx << 8);

#ifdef RT_CAN_USING_CANFD
        if (can->fd_enabled)
        {
            rxXfer.framefd = &can->framefd[mb_idx - RX_MB_IDX];
            rxXfer.frame = RT_NULL;
            rxXfer.mbIdx = mb_idx;
            FLEXCAN_TransferFDReceiveNonBlocking(can->base, &can->handle, &rxXfer);
        }
        else
#endif
        {
            rxXfer.frame = &can->frame[mb_idx - RX_MB_IDX];
#ifdef RT_CAN_USING_CANFD
            rxXfer.framefd = RT_NULL;
#endif
            rxXfer.mbIdx = mb_idx;
            FLEXCAN_TransferReceiveNonBlocking(can->base, &can->handle, &rxXfer);
        }
        break;

    case kStatus_FLEXCAN_TxIdle:
        rt_hw_can_isr(&can->can_dev, RT_CAN_EVENT_TX_DONE | result << 8);
        break;
    default:
        break;
    }
}

static rt_err_t _can_config(struct rt_can_device *can_dev, struct can_configure *cfg)
{
    struct imxrt_can *can = (struct imxrt_can *)can_dev->parent.user_data;
    flexcan_config_t config;
    flexcan_timing_config_t timing_config;
    rt_uint32_t clk_freq;
    rt_err_t res = RT_EOK;

    can_dev->config = *cfg;
    _can_enable_periph_clock(can);
    clk_freq = CLOCK_GetFlexcanClkFreq(can->instance);
    if (clk_freq == 0U)
    {
        rt_kprintf("%s: flexcan clock is 0\n", can->name);
        return -RT_ERROR;
    }

    _can_safe_deinit(can);

    FLEXCAN_GetDefaultConfig(&config);
    config.baudRate = cfg->baud_rate;
    config.maxMbNum = 8;
    config.enableIndividMask = true;
    config.enableSupervisorMode = false;
    config.disableSelfReception = !_can_is_loopback(cfg);
    _can_setup_mode(&config, cfg);

    if (_can_is_loopback(cfg))
    {
        config.enableTransceiverDelayMeasure = false;
    }

    rt_memset(&timing_config, 0, sizeof(flexcan_timing_config_t));

#ifdef RT_CAN_USING_CANFD
    can->fd_enabled = (cfg->enable_canfd != 0) ? RT_TRUE : RT_FALSE;

    if (can->fd_enabled)
    {
        bool brs_enable = _can_is_loopback(cfg) ? false : true;
        bool timing_ok;

        config.bitRateFD = _can_is_loopback(cfg) ? config.baudRate :
                           (cfg->baud_rate_fd ? cfg->baud_rate_fd : 2000000U);

        timing_ok = FLEXCAN_FDCalculateImprovedTimingValues(can->base, config.baudRate,
                                                            config.bitRateFD, clk_freq, &timing_config);
        if (timing_ok)
        {
            rt_memcpy(&(config.timingConfig), &timing_config, sizeof(flexcan_timing_config_t));
        }

        FLEXCAN_FDInit(can->base, &config, clk_freq, kFLEXCAN_16BperMB, brs_enable);
        if (!timing_ok)
        {
            if (FLEXCAN_SetFDBitRate(can->base, clk_freq, config.baudRate, config.bitRateFD) != kStatus_Success)
            {
                rt_kprintf("%s: CAN FD timing setup failed, clk=%u\n", can->name, clk_freq);
                return -RT_ERROR;
            }
        }
    }
    else
#endif
    {
        if (FLEXCAN_CalculateImprovedTimingValues(can->base, config.baudRate, clk_freq, &timing_config))
        {
            rt_memcpy(&(config.timingConfig), &timing_config, sizeof(flexcan_timing_config_t));
        }

        FLEXCAN_Init(can->base, &config, clk_freq);
    }

    can->filter_mask = 0;
    FLEXCAN_TransferCreateHandle(can->base, &can->handle, flexcan_callback, can);
    if (_can_is_loopback(cfg))
    {
        _can_setup_loopback_mb(can);
    }
    else
    {
        _can_start_rx(can);
    }
    _can_enable_controller_irq(can);

    return res;
}

static rt_err_t _can_control(struct rt_can_device *can_dev, int cmd, void *arg)
{
    struct imxrt_can *can;
    rt_uint32_t argval, mask;
    rt_err_t res = RT_EOK;
    flexcan_rx_mb_config_t mbConfig;
    struct rt_can_filter_config *cfg;
    struct rt_can_filter_item *item;
    rt_uint8_t i, count, index;

    RT_ASSERT(can_dev != RT_NULL);

    can = (struct imxrt_can *)can_dev->parent.user_data;
    RT_ASSERT(can != RT_NULL);

