RT-Thread/rt-thread/bsp/nxp/mcx/mcxa/Libraries/drivers/drv_can.c
    switch (cmd)
    {
    case RT_DEVICE_CTRL_SET_INT:
        argval = (rt_uint32_t)arg;
        if (argval == RT_DEVICE_FLAG_INT_RX || argval == RT_DEVICE_FLAG_INT_TX ||
            argval == RT_DEVICE_CAN_INT_ERR)
        {
            _can_enable_controller_irq(can);
        }
        else
        {
            res = -RT_ERROR;
        }
        break;
    case RT_DEVICE_CTRL_CLR_INT:
        DisableIRQ(can->irqn);
        break;
    case RT_CAN_CMD_SET_FILTER:
        cfg = (struct rt_can_filter_config *)arg;
        item = cfg->items;
        count = cfg->count;

        if (can->filter_mask == 0xffffffff)
        {
            rt_kprintf("%s filter is full!\n", can->name);
            res = -RT_ERROR;
            break;
        }
        else if (can->filter_mask == 0)
        {
            for (i = 0; i < RX_MB_COUNT; i++)
            {
#ifdef RT_CAN_USING_CANFD
                if (can->fd_enabled)
                {
                    FLEXCAN_SetFDRxMbConfig(can->base, i + 1, RT_NULL, false);
                }
                else
#endif
                {
                    FLEXCAN_SetRxMbConfig(can->base, i + 1, RT_NULL, false);
                }
            }
        }

        while (count)
        {
            if (item->ide)
            {
                mbConfig.format = kFLEXCAN_FrameFormatExtend;
                mbConfig.id = FLEXCAN_ID_EXT(item->id);
                mask = FLEXCAN_RX_MB_EXT_MASK(item->mask, 0, 0);
            }
            else
            {
                mbConfig.format = kFLEXCAN_FrameFormatStandard;
                mbConfig.id = FLEXCAN_ID_STD(item->id);
                mask = FLEXCAN_RX_MB_STD_MASK(item->mask, 0, 0);
            }

            mbConfig.type = item->rtr ? kFLEXCAN_FrameTypeRemote : kFLEXCAN_FrameTypeData;

            if (item->hdr_bank == -1)
            {
                for (i = 0; i < 32; i++)
                {
                    if (!(can->filter_mask & (1 << i)))
                    {
                        index = i;
                        break;
                    }
                }
            }
            else
            {
                if (can->filter_mask & (1 << item->hdr_bank))
                {
                    res = -RT_ERROR;
                    rt_kprintf("%s hdr%d filter already set!\n", can->name, item->hdr_bank);
                    break;
                }
                index = item->hdr_bank;
            }

            FLEXCAN_SetRxIndividualMask(can->base, index + 1, mask);
#ifdef RT_CAN_USING_CANFD
            if (can->fd_enabled)
            {
                FLEXCAN_SetFDRxMbConfig(can->base, index + 1, &mbConfig, true);
            }
            else
#endif
            {
                FLEXCAN_SetRxMbConfig(can->base, index + 1, &mbConfig, true);
            }
            can->filter_mask |= 1 << index;

            item++;
            count--;
        }
        break;

    case RT_CAN_CMD_SET_BAUD:
        if (arg != RT_NULL)
        {
            can->can_dev.config.baud_rate = *(rt_uint32_t *)arg;
            res = _can_config(can_dev, &can->can_dev.config);
        }
        else
        {
            res = -RT_ERROR;
        }
        break;
    case RT_CAN_CMD_SET_MODE:
        argval = (rt_uint32_t)arg;
        if (argval > RT_CAN_MODE_LOOPBACKANLISTEN)
        {
            res = -RT_ERROR;
            break;
        }
        can->can_dev.config.mode = argval;
        res = _can_config(can_dev, &can->can_dev.config);
        break;
#ifdef RT_CAN_USING_CANFD
    case RT_CAN_CMD_SET_CANFD:
        argval = (rt_uint32_t)arg;
        can->can_dev.config.enable_canfd = argval ? 1 : 0;
        res = _can_config(can_dev, &can->can_dev.config);
        break;
    case RT_CAN_CMD_SET_BAUD_FD:
        if (arg != RT_NULL)
        {
            can->can_dev.config.baud_rate_fd = *(rt_uint32_t *)arg;
            res = _can_config(can_dev, &can->can_dev.config);
        }
        else
        {
            res = -RT_ERROR;
        }
        break;
#endif
    case RT_CAN_CMD_SET_PRIV:
        res = -RT_ERROR;
        break;
    case RT_CAN_CMD_GET_STATUS:
        FLEXCAN_GetBusErrCount(can->base, (rt_uint8_t *)(&can->can_dev.status.snderrcnt),
                               (rt_uint8_t *)(&can->can_dev.status.rcverrcnt));
        rt_memcpy(arg, &can->can_dev.status, sizeof(can->can_dev.status));
        break;
    case RT_CAN_CMD_START:
        break;
    default:
        res = -RT_ERROR;
        break;
    }

    return res;
}

#ifdef RT_CAN_USING_CANFD
static void _can_fill_fd_frame(flexcan_fd_frame_t *frame, const struct rt_can_msg *msg)
{
    rt_uint8_t dlc;
    rt_uint8_t data_len;

    rt_memset(frame, 0, sizeof(*frame));

    if (RT_CAN_STDID == msg->ide)
    {
        frame->id = FLEXCAN_ID_STD(msg->id);
        frame->format = kFLEXCAN_FrameFormatStandard;
    }
    else
    {
        frame->id = FLEXCAN_ID_EXT(msg->id);
        frame->format = kFLEXCAN_FrameFormatExtend;
    }

    frame->type = (RT_CAN_DTR == msg->rtr) ? kFLEXCAN_FrameTypeData : kFLEXCAN_FrameTypeRemote;
    frame->edl = 1;
    frame->brs = msg->brs ? 1 : 0;

    dlc = (msg->len <= 15) ? msg->len : _can_len2dlc((rt_uint8_t)msg->len);
    frame->length = dlc;
    data_len = _can_dlc2len(dlc);
    rt_memcpy(frame->dataWord, msg->data, data_len);
}

static void _can_parse_fd_frame(struct rt_can_msg *msg, const flexcan_fd_frame_t *frame)
{
    rt_uint8_t data_len;

    if (frame->format == kFLEXCAN_FrameFormatStandard)
    {
        msg->ide = RT_CAN_STDID;
        msg->id = frame->id >> CAN_ID_STD_SHIFT;
    }
    else
    {
        msg->ide = RT_CAN_EXTID;
        msg->id = frame->id >> CAN_ID_EXT_SHIFT;
    }

    msg->rtr = (frame->type == kFLEXCAN_FrameTypeData) ? RT_CAN_DTR : RT_CAN_RTR;
    msg->fd_frame = frame->edl ? 1 : 0;
    msg->brs = frame->brs ? 1 : 0;
    msg->len = frame->length;
    data_len = _can_dlc2len(frame->length);
    rt_memcpy(msg->data, frame->dataWord, data_len);
}
#endif

static rt_ssize_t _can_sendmsg(struct rt_can_device *can_dev, const void *buf, rt_uint32_t boxno)
{
    struct imxrt_can *can;
    struct rt_can_msg *msg;
    status_t ret = kStatus_Fail;
    rt_uint8_t hw_mb = TX_MB_IDX;

    RT_ASSERT(can_dev != RT_NULL);
    RT_ASSERT(buf != RT_NULL);

    can = (struct imxrt_can *)can_dev->parent.user_data;
    msg = (struct rt_can_msg *)buf;
    RT_UNUSED(boxno);

    if (!_can_is_loopback(&can_dev->config))
    {
        _can_abort_rx(can);
    }
    else
    {
        _can_setup_loopback_mb(can);
    }

