RT-Thread/rt-thread/bsp/nxp/mcx/mcxa/Libraries/drivers/drv_can.c
#ifdef RT_CAN_USING_CANFD
    if (can->fd_enabled && msg->fd_frame)
    {
        flexcan_fd_frame_t tx_frame;

        FLEXCAN_ClearMbStatusFlags(can->base, ((uint64_t)1U << hw_mb) | ((uint64_t)1U << RX_MB_IDX));
        FLEXCAN_SetFDTxMbConfig(can->base, hw_mb, true);
        _can_fill_fd_frame(&tx_frame, msg);

        if (FLEXCAN_WriteFDTxMb(can->base, hw_mb, &tx_frame) != kStatus_Success)
        {
            ret = kStatus_Fail;
        }
        else
        {
            ret = _can_wait_mb_tx_done(can, hw_mb);
        }

        if (ret == kStatus_Success && _can_is_loopback(&can_dev->config))
        {
            ret = _can_wait_mb_rx_done(can->base, RX_MB_IDX);
            if (ret == kStatus_Success)
            {
                ret = FLEXCAN_ReadFDRxMb(can->base, RX_MB_IDX, &can->framefd[0]);
                if (ret == kStatus_Success)
                {
                    _can_loopback_post_rx(can);
                }
            }
        }
    }
    else
#endif
    {
        flexcan_frame_t tx_frame;

        FLEXCAN_ClearMbStatusFlags(can->base, ((uint64_t)1U << hw_mb) | ((uint64_t)1U << RX_MB_IDX));
        FLEXCAN_SetTxMbConfig(can->base, hw_mb, true);
        _can_fill_classic_frame(&tx_frame, msg);

        if (FLEXCAN_WriteTxMb(can->base, hw_mb, &tx_frame) != kStatus_Success)
        {
            ret = kStatus_Fail;
        }
        else
        {
            ret = _can_wait_mb_tx_done(can, hw_mb);
        }

        if (ret == kStatus_Success && _can_is_loopback(&can_dev->config))
        {
            ret = _can_wait_mb_rx_done(can->base, RX_MB_IDX);
            if (ret == kStatus_Success)
            {
                ret = FLEXCAN_ReadRxMb(can->base, RX_MB_IDX, &can->frame[0]);
                if (ret == kStatus_Success)
                {
                    _can_loopback_post_rx(can);
                }
            }
        }
    }

    if (ret == kStatus_Success)
    {
        rt_hw_can_isr(&can->can_dev, RT_CAN_EVENT_TX_DONE | boxno << 8);
        return RT_EOK;
    }

    if (ret == kStatus_Timeout)
    {
        _can_dump_err(can, "loopback timeout");
    }

    return -RT_ERROR;
}

static rt_ssize_t _can_recvmsg(struct rt_can_device *can_dev, void *buf, rt_uint32_t boxno)
{
    struct imxrt_can *can;
    struct rt_can_msg *pmsg;
    rt_uint8_t index;

    RT_ASSERT(can_dev != RT_NULL);

    can = (struct imxrt_can *)can_dev->parent.user_data;
    pmsg = (struct rt_can_msg *)buf;
    index = (boxno >= RX_MB_IDX) ? (boxno - RX_MB_IDX) : 0;

#ifdef RT_CAN_USING_CANFD
    if (can->fd_enabled && can->framefd[index].edl)
    {
        _can_parse_fd_frame(pmsg, &can->framefd[index]);
    }
    else if (can->fd_enabled)
    {
        _can_parse_classic_frame(pmsg, (const flexcan_frame_t *)&can->framefd[index]);
        pmsg->fd_frame = 0;
        pmsg->brs = 0;
    }
    else
#endif
    {
        _can_parse_classic_frame(pmsg, &can->frame[index]);
    }

    pmsg->hdr_index = index;

    return 0;
}

static uint8_t FLEXCAN_GetFirstValidMb(CAN_Type *base)
{
    uint8_t firstValidMbNum;

    if (0U != (base->MCR & CAN_MCR_RFEN_MASK))
    {
        firstValidMbNum = (uint8_t)((base->CTRL2 & CAN_CTRL2_RFFN_MASK) >> CAN_CTRL2_RFFN_SHIFT);
        firstValidMbNum = ((firstValidMbNum + 1U) * 2U) + 6U;
    }
    else
    {
        firstValidMbNum = 0U;
    }

    return firstValidMbNum;
}

static rt_ssize_t _can_sendmsg_nonblocking(struct rt_can_device *can_dev, const void *buf)
{
    struct imxrt_can *can;
    struct rt_can_msg *msg;
    status_t ret;
    rt_uint32_t boxno;

    RT_ASSERT(can_dev != RT_NULL);
    RT_ASSERT(buf != RT_NULL);

    can = (struct imxrt_can *)can_dev->parent.user_data;
    msg = (struct rt_can_msg *)buf;
    boxno = FLEXCAN_GetFirstValidMb(can->base);

    if (boxno == 0xFF)
    {
        return -RT_EBUSY;
    }

#ifdef RT_CAN_USING_CANFD
    if (can->fd_enabled && msg->fd_frame)
    {
        flexcan_mb_transfer_t txXfer;
        flexcan_fd_frame_t tx_frame;

        FLEXCAN_SetFDTxMbConfig(can->base, boxno, true);
        _can_fill_fd_frame(&tx_frame, msg);
        txXfer.mbIdx = boxno;
        txXfer.framefd = &tx_frame;
        txXfer.frame = RT_NULL;
        ret = FLEXCAN_TransferFDSendNonBlocking(can->base, &can->handle, &txXfer);
    }
    else
#endif
    {
        flexcan_mb_transfer_t txXfer;
        flexcan_frame_t tx_frame;

        _can_fill_classic_frame(&tx_frame, msg);
        txXfer.mbIdx = boxno;
        txXfer.frame = &tx_frame;
#ifdef RT_CAN_USING_CANFD
        txXfer.framefd = RT_NULL;
#endif
        ret = FLEXCAN_TransferSendNonBlocking(can->base, &can->handle, &txXfer);
    }

    return (ret == kStatus_Success) ? RT_EOK : -RT_ERROR;
}

static struct rt_can_ops imxrt_can_ops =
{
    .configure    = _can_config,
    .control      = _can_control,
    .sendmsg      = _can_sendmsg,
    .recvmsg      = _can_recvmsg,
    .sendmsg_nonblocking = _can_sendmsg_nonblocking
};

int rt_hw_can_init(void)
{
    int i;
    rt_err_t ret = RT_EOK;
    struct can_configure config = CANDEFAULTCONFIG;

    config.privmode = 0;
    config.ticks = 50;
    config.sndboxnumber = 1;
    config.msgboxsz = RX_MB_COUNT;
#ifdef RT_CAN_USING_HDR
    config.maxhdr = RX_MB_COUNT;
#endif
#ifdef RT_CAN_USING_CANFD
    config.enable_canfd = 1;
    config.baud_rate_fd = 2000000;
#endif

    for (i = 0; i < sizeof(flexcans) / sizeof(flexcans[0]); i++)
    {
        flexcans[i].can_dev.config = config;
        flexcans[i].filter_mask = 0;
        _can_enable_periph_clock(&flexcans[i]);

        ret = rt_hw_can_register(&flexcans[i].can_dev, flexcans[i].name, &imxrt_can_ops, &flexcans[i]);
    }

    return ret;
}
INIT_BOARD_EXPORT(rt_hw_can_init);

#endif /* RT_USING_CAN */
